Revit 2026 API

# DoubleParameterValue Class

---

A class that holds a Double value of a parameter element.

SystemObject Autodesk.Revit.DBParameterValue Autodesk.Revit.DBDoubleParameterValue

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DoubleParameterValue : ParameterValue
```
```vb
Public Class DoubleParameterValue
	Inherits ParameterValue
```
```cpp
public ref class DoubleParameterValue : public ParameterValue
```
```fsharp
type DoubleParameterValue =
    class
        inherit ParameterValue
    end
```

The DoubleParameterValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DoubleParameterValue | Default constructor |
|  | DoubleParameterValue(Double) | Value constructor |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ParameterValue) |
|  | Value | The stored value |

|  | Name | Description |
| --- | --- | --- |
|  | Copy | Makes an identical copy of the given parameter value. (Inherited from ParameterValue) |
|  | Dispose | (Inherited from ParameterValue) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Tests equality with another instance of the same class. (Inherited from ParameterValue) |
|  | IsSameType | Tests another instance is of the same value type. (Inherited from ParameterValue) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace